[
  "Walz (Democratic Party) ran for re-election for Governor of Minnesota. He won in the general election on November 8, 2022.",
  "Democratic Party",
  "Walz was born in 1964 in West Point, NE. After graduating from public high school in Butte, NE, Walz went on to earn his B.S. at Chadron State College and his M.S. at Minnesota State University in 1989 and 2001, respectively, having also attended Saint Mary’s University of Minnesota. Prior to his political career, Walz worked as a school teacher. He also served in the Army National Guard and is a veteran of Operation Enduring Freedom.[1]\n",
  "Jensen (Republican Party) ran for election for Governor of Minnesota. He lost in the general election on November 8, 2022.",
  "Republican Party",
  "Scott Jensen was born in Sleepy Eye, Minnesota. Jensen earned an undergraduate degree and a medical degree from the University of Minnesota.[1] His career experience includes owning Catalyst Medical Clinic PA and working as a physician.[2]\n",
  "Steve Patterson (Grassroots-Legalize Cannabis Party of Minnesota) ran for election for Governor of Minnesota. He lost in the general election on November 8, 2022.",
  "Grassroots-Legalize Cannabis Party of Minnesota",
  "Steve Patterson's career experience includes owning a business and working as a hospital security officer.[1]\n",
  "Hugh McTavish (Independence-Alliance Party of Minnesota) ran for election for Governor of Minnesota. He lost in the general election on November 8, 2022.",
  "Independence-Alliance Party of Minnesota",
  "Hugh McTavish earned a bachelor's degree from Carleton College in 1984, a Ph.D. from the University of Minnesota in 1992, and a law degree from the University of Minnesota in 2001.[1] McTavish's career experience includes founding COVID Sanity and working as its executive director, a biochemist and immunologist, a patent attorney, and the CEO of IGF Oncology, LLC, and Squarex, LLC.[2]\n",
  "James McCaskel (Legal Marijuana Now Party) ran for election for Governor of Minnesota. He lost in the general election on November 8, 2022.",
  "Legal Marijuana Now Party",
  "James McCaskel was born in Minneapolis, Minnesota.[1] McCaskel's career experience includes working as a community organizer and political scientist.[2]\n",
  "Gabrielle Prosser (Socialist Workers Party) ran for election for Governor of Minnesota. She lost in the general election on November 8, 2022.",
  "Socialist Workers Party",
  "Prosser's previous experience includes working at a candy shop, various restaurants, and coffee shops.[1]\n"
]